{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "finetuning_task": "image-classification",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Abyssinian",
    "1": "American Bobtail",
    "10": "British Shorthair",
    "11": "Burmese",
    "12": "Burmilla",
    "13": "Calico",
    "14": "Canadian Hairless",
    "15": "Chartreux",
    "16": "Chausie",
    "17": "Chinchilla",
    "18": "Cornish Rex",
    "19": "Cymric",
    "2": "American Curl",
    "20": "Devon Rex",
    "21": "Dilute Calico",
    "22": "Dilute Tortoiseshell",
    "23": "Domestic Long Hair",
    "24": "Domestic Medium Hair",
    "25": "Domestic Short Hair",
    "26": "Egyptian Mau",
    "27": "Exotic Shorthair",
    "28": "Extra-Toes Cat - Hemingway Polydactyl",
    "29": "Havana",
    "3": "American Shorthair",
    "30": "Himalayan",
    "31": "Japanese Bobtail",
    "32": "Javanese",
    "33": "Korat",
    "34": "LaPerm",
    "35": "Maine Coon",
    "36": "Manx",
    "37": "Munchkin",
    "38": "Nebelung",
    "39": "Norwegian Forest Cat",
    "4": "American Wirehair",
    "40": "Ocicat",
    "41": "Oriental Long Hair",
    "42": "Oriental Short Hair",
    "43": "Oriental Tabby",
    "44": "Persian",
    "45": "Pixiebob",
    "46": "Ragamuffin",
    "47": "Ragdoll",
    "48": "Russian Blue",
    "49": "Scottish Fold",
    "5": "Applehead Siamese",
    "50": "Selkirk Rex",
    "51": "Siamese",
    "52": "Siberian",
    "53": "Silver",
    "54": "Singapura",
    "55": "Snowshoe",
    "56": "Somali",
    "57": "Sphynx - Hairless Cat",
    "58": "Tabby",
    "59": "Tiger",
    "6": "Balinese",
    "60": "Tonkinese",
    "61": "Torbie",
    "62": "Tortoiseshell",
    "63": "Turkish Angora",
    "64": "Turkish Van",
    "65": "Tuxedo",
    "66": "York Chocolate",
    "7": "Bengal",
    "8": "Birman",
    "9": "Bombay"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Abyssinian": "0",
    "American Bobtail": "1",
    "American Curl": "2",
    "American Shorthair": "3",
    "American Wirehair": "4",
    "Applehead Siamese": "5",
    "Balinese": "6",
    "Bengal": "7",
    "Birman": "8",
    "Bombay": "9",
    "British Shorthair": "10",
    "Burmese": "11",
    "Burmilla": "12",
    "Calico": "13",
    "Canadian Hairless": "14",
    "Chartreux": "15",
    "Chausie": "16",
    "Chinchilla": "17",
    "Cornish Rex": "18",
    "Cymric": "19",
    "Devon Rex": "20",
    "Dilute Calico": "21",
    "Dilute Tortoiseshell": "22",
    "Domestic Long Hair": "23",
    "Domestic Medium Hair": "24",
    "Domestic Short Hair": "25",
    "Egyptian Mau": "26",
    "Exotic Shorthair": "27",
    "Extra-Toes Cat - Hemingway Polydactyl": "28",
    "Havana": "29",
    "Himalayan": "30",
    "Japanese Bobtail": "31",
    "Javanese": "32",
    "Korat": "33",
    "LaPerm": "34",
    "Maine Coon": "35",
    "Manx": "36",
    "Munchkin": "37",
    "Nebelung": "38",
    "Norwegian Forest Cat": "39",
    "Ocicat": "40",
    "Oriental Long Hair": "41",
    "Oriental Short Hair": "42",
    "Oriental Tabby": "43",
    "Persian": "44",
    "Pixiebob": "45",
    "Ragamuffin": "46",
    "Ragdoll": "47",
    "Russian Blue": "48",
    "Scottish Fold": "49",
    "Selkirk Rex": "50",
    "Siamese": "51",
    "Siberian": "52",
    "Silver": "53",
    "Singapura": "54",
    "Snowshoe": "55",
    "Somali": "56",
    "Sphynx - Hairless Cat": "57",
    "Tabby": "58",
    "Tiger": "59",
    "Tonkinese": "60",
    "Torbie": "61",
    "Tortoiseshell": "62",
    "Turkish Angora": "63",
    "Turkish Van": "64",
    "Tuxedo": "65",
    "York Chocolate": "66"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.35.0"
}
